set_property BITSTREAM.CONFIG.BPI_SYNC_MODE Type1 [current_design]
set_property BITSTREAM.CONFIG.EXTMASTERCCLK_EN div-1 [current_design]
set_property BITSTREAM.GENERAL.COMPRESS FALSE [current_design]
set_property BITSTREAM.CONFIG.UNUSEDPIN Pulldown [current_design]
set_property CONFIG_MODE BPI16 [current_design]
set_property CFGBVS GND [current_design]
set_property CONFIG_VOLTAGE 1.8 [current_design]

#set_property -dict {PACKAGE_PIN E18 IOSTANDARD LVDS} [get_ports sys_clk_n]
#set_property -dict {PACKAGE_PIN E19 IOSTANDARD LVDS} [get_ports sys_clk_p]
#set_property -dict {PACKAGE_PIN AV40 IOSTANDARD LVCMOS18} [get_ports sys_rst]

set_property -dict {PACKAGE_PIN AV30 IOSTANDARD LVCMOS18} [get_ports {gpio_input[0]}]
set_property -dict {PACKAGE_PIN AY33 IOSTANDARD LVCMOS18} [get_ports {gpio_input[1]}]
set_property -dict {PACKAGE_PIN BA31 IOSTANDARD LVCMOS18} [get_ports {gpio_input[2]}]
set_property -dict {PACKAGE_PIN BA32 IOSTANDARD LVCMOS18} [get_ports {gpio_input[3]}]
set_property -dict {PACKAGE_PIN AW30 IOSTANDARD LVCMOS18} [get_ports {gpio_input[4]}]
set_property -dict {PACKAGE_PIN AY30 IOSTANDARD LVCMOS18} [get_ports {gpio_input[5]}]
set_property -dict {PACKAGE_PIN BA30 IOSTANDARD LVCMOS18} [get_ports {gpio_input[6]}]
set_property -dict {PACKAGE_PIN BB31 IOSTANDARD LVCMOS18} [get_ports {gpio_input[7]}]

set_property -dict {PACKAGE_PIN AM39 IOSTANDARD LVCMOS18} [get_ports {gpio_output[0]}]
set_property -dict {PACKAGE_PIN AN39 IOSTANDARD LVCMOS18} [get_ports {gpio_output[1]}]
set_property -dict {PACKAGE_PIN AR37 IOSTANDARD LVCMOS18} [get_ports {gpio_output[2]}]
set_property -dict {PACKAGE_PIN AT37 IOSTANDARD LVCMOS18} [get_ports {gpio_output[3]}]
set_property -dict {PACKAGE_PIN AR35 IOSTANDARD LVCMOS18} [get_ports {gpio_output[4]}]
set_property -dict {PACKAGE_PIN AP41 IOSTANDARD LVCMOS18} [get_ports {gpio_output[5]}]
set_property -dict {PACKAGE_PIN AP42 IOSTANDARD LVCMOS18} [get_ports {gpio_output[6]}]
set_property -dict {PACKAGE_PIN AU39 IOSTANDARD LVCMOS18} [get_ports {gpio_output[7]}]

set_property -dict {PACKAGE_PIN AU36 IOSTANDARD LVCMOS18} [get_ports uart_tx]
set_property -dict {PACKAGE_PIN AU33 IOSTANDARD LVCMOS18} [get_ports uart_rx]

create_clock -period 20.000 -name clock -add [get_nets aclk]
create_clock -period 5.000 -name sys_clock

set_input_delay -clock [get_clocks clock] -min -add_delay 2.000 [get_ports {gpio_input[*]}]
set_input_delay -clock [get_clocks clock] -max -add_delay 2.000 [get_ports {gpio_input[*]}]
set_output_delay -clock [get_clocks clock] -min -add_delay 0.000 [get_ports {gpio_output[*]}]
set_output_delay -clock [get_clocks clock] -max -add_delay 0.000 [get_ports {gpio_output[*]}]

set_input_delay -clock [get_clocks sys_clock] -max -add_delay 0.500 [get_ports {DDR3_dqs_p[*]}]
set_input_delay -clock [get_clocks sys_clock] -min -add_delay 0.500 [get_ports {DDR3_dqs_p[*]}]
set_input_delay -clock [get_clocks sys_clock] -max -add_delay 0.500 [get_ports {DDR3_dqs_n[*]}]
set_input_delay -clock [get_clocks sys_clock] -min -add_delay 0.500 [get_ports {DDR3_dqs_n[*]}]
set_input_delay -clock [get_clocks sys_clock] -max -add_delay 0.500 [get_ports sys_rst]
set_input_delay -clock [get_clocks sys_clock] -min -add_delay 0.500 [get_ports sys_rst]
set_output_delay -clock [get_clocks sys_clock] -max -add_delay 0.500 [get_ports DDR3_reset_n]
set_output_delay -clock [get_clocks sys_clock] -min -add_delay 0.500 [get_ports DDR3_reset_n]

create_clock -period 104166.672 -name virtual_uart_baud_clock -waveform {10.000 52093.328}
set_input_delay -clock [get_clocks virtual_uart_baud_clock] -min -add_delay 2.000 [get_ports uart_rx]
set_input_delay -clock [get_clocks virtual_uart_baud_clock] -max -add_delay 2.000 [get_ports uart_rx]
set_output_delay -clock [get_clocks virtual_uart_baud_clock] -min -add_delay 2.000 [get_ports uart_tx]
set_output_delay -clock [get_clocks virtual_uart_baud_clock] -max -add_delay 2.000 [get_ports uart_tx]

set_false_path -from [get_clocks sys_clock] -to [get_clocks mmcm_ps_clk_bufg_in]
set_false_path -from [get_clocks clk_pll_i] -to [get_clocks sys_clock]
set_false_path -from [get_clocks oserdes_clk] -to [get_clocks oserdes_clkdiv]
set_false_path -from [get_clocks oserdes_clk_1] -to [get_clocks oserdes_clkdiv_1]
set_false_path -from [get_clocks oserdes_clk_2] -to [get_clocks oserdes_clkdiv_2]
set_false_path -from [get_clocks oserdes_clk_3] -to [get_clocks oserdes_clkdiv_3]
set_false_path -from [get_clocks oserdes_clk_4] -to [get_clocks oserdes_clkdiv_4]
set_false_path -from [get_clocks oserdes_clk_5] -to [get_clocks oserdes_clkdiv_5]
set_false_path -from [get_clocks oserdes_clk_6] -to [get_clocks oserdes_clkdiv_6]
set_false_path -from [get_clocks oserdes_clk_7] -to [get_clocks oserdes_clkdiv_7]
set_false_path -from [get_clocks oserdes_clk_8] -to [get_clocks oserdes_clkdiv_8]
set_false_path -from [get_clocks oserdes_clk_9] -to [get_clocks oserdes_clkdiv_9]
set_false_path -from [get_clocks oserdes_clk_10] -to [get_clocks oserdes_clkdiv_10]
set_false_path -from [get_clocks mmcm_ps_clk_bufg_in] -to [get_clocks clk_pll_i]
