set_property PACKAGE_PIN L16 [get_ports raw_clock]
set_property IOSTANDARD LVCMOS33 [get_ports raw_clock]; # 125 MHz 
set_property PACKAGE_PIN G15 [get_ports {gpio_input[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {gpio_input[0]}]
set_property PACKAGE_PIN P15 [get_ports {gpio_input[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {gpio_input[1]}]
set_property PACKAGE_PIN W13 [get_ports {gpio_input[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {gpio_input[2]}]
set_property PACKAGE_PIN T16 [get_ports {gpio_input[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {gpio_input[3]}]
set_property PACKAGE_PIN M14 [get_ports {gpio_output[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {gpio_output[0]}]
set_property PACKAGE_PIN M15 [get_ports {gpio_output[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {gpio_output[1]}]
set_property PACKAGE_PIN G14 [get_ports {gpio_output[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {gpio_output[2]}]
set_property PACKAGE_PIN D18 [get_ports {gpio_output[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {gpio_output[3]}]

create_clock -period 20.000 -name vclock -waveform {0.000 10.000}
set_input_delay -clock [get_clocks vclock] -min -add_delay 2.000 [get_ports {gpio_input[*]}]
set_input_delay -clock [get_clocks vclock] -max -add_delay 2.000 [get_ports {gpio_input[*]}]
set_output_delay -clock [get_clocks vclock] -min -add_delay 0.000 [get_ports {gpio_output[*]}]
set_output_delay -clock [get_clocks vclock] -max -add_delay 0.000 [get_ports {gpio_output[*]}]
